&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Список.ТекстЗапроса);
	
	Запрос = СхемаЗапроса.ПакетЗапросов[0];
	ЗапросВыбрать = Запрос.Операторы[0];
	
	Для Каждого Таблица Из ЗапросВыбрать.Источники Цикл
		Если Таблица.Источник.ИмяТаблицы = "РегистрНакопления.ТоварыНаСкладах.Остатки" Тогда
			УсловиеОстатки = Таблица.Источник.Параметры[1];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Склад) Тогда
		УсловиеОстатки.Выражение = Новый ВыражениеСхемыЗапроса("Склад = &Склад");
		Список.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
		Список.Параметры.УстановитьЗначениеПараметра("Склад",Склад);
	Иначе
		УсловиеОстатки.Выражение = Новый ВыражениеСхемыЗапроса("");
		Список.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
КонецПроцедуры


