&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Родитель",Справочники.Номенклатура.ПустаяСсылка());
КонецПроцедуры

&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("СписокГруппПриАктивизацииСтрокиЗавершение",0.2,Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокГруппПриАктивизацииСтрокиЗавершение()
	Список.Параметры.УстановитьЗначениеПараметра("Родитель",Элементы.СписокГрупп.ТекущаяСтрока);
КонецПроцедуры // СписокГруппПриАктивизацииСтрокиЗавершение()



